OdIfcEntResolver.resolve(OdIfc.OdIfcEntity*)
\details
Resolves the model's entity.
\param inst     [in] A pointer to the entity instance to be resolved.
\returns Returns true if the entity was successfully resolved; otherwise, the method returns false.

OdIfcEntResolver.setComposeTypes(OdArray&lt;OdIfc.OdIfcEntityType,OdObjectsAllocator&lt;OdIfc.OdIfcEntityType&gt;&gt;!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Sets a set of IfcProduct-base entity types for process into resolver. All other
type branches will be resolved by default. Empty array allows compose for all IfcProducts.

OdIfcEntResolver.setFile(OdIfcFile*)
\details
Sets a new model to the entity resolver object.
\param model [in] A raw pointer to the model's content object to be set.